Repository: HimaYoussef/smart_medic
Catalog: lib/l10n/intl_*.arb
Languages: ar

# build_text_field_validatorText2
source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

# build_text_field_validatorText3
source: Password must include uppercase, lowercase, and digits
ar: يجب أن تحتوي كلمة المرور على حرف كبير وحرف صغير وأرقام

# build_text_field_validatorText4
source: Please Enter Your Age
ar: يرجى إدخال عمرك

# build_text_field_validatorText5
source: Please Enter a valid Age
ar: يرجى إدخال عمر صالح

# build_text_field_validatorText6
source: Value must be greater than 0
ar: يجب أن تكون القيمة أكبر من 0

# changePassPage_New_password_and_confirmation_do_not_match
source: New password and confirmation do not match.
ar: كلمة المرور الجديدة وتأكيدها غير متطابقين.

# changePassPage_no_user
source: no-user
ar: لا يوجد مستخدم

# changePassPage_No_user_is_signed_in
source: No user is signed in.
ar: لا يوجد مستخدم مسجل الدخول.

# changePassPage_Password_changed_successfully
source: Password changed successfully!
ar: تم تغيير كلمة المرور بنجاح!

# changePassPage_An_unexpected_error_occurred
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

# changePassPage_Change_Password
source: Change Password
ar: تغيير كلمة المرور

# changePassPage_Current_Password
source: Current Password
ar: كلمة المرور الحالية

# changePassPage_Please_enter_your_current_password
source: Please enter your current password
ar: يرجى إدخال كلمة المرور الحالية

# changePassPage_Enter_Current_Password
source: Enter Current Password
ar: أدخل كلمة المرور الحالية

# changePassPage_New_Password
source: New Password
ar: كلمة المرور الجديدة

# changePassPage_Please_enter_a_valid_new_password_at_least_6_characters
source: Please enter a valid new password (at least 6 characters)
ar: يرجى إدخال كلمة مرور جديدة صالحة (لا تقل عن 6 أحرف)

# changePassPage_Enter_New_Password
source: Enter New Password
ar: أدخل كلمة المرور الجديدة

# changePassPage_Confirm_New_Password
source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

# changePassPage_Please_confirm_your_new_password
source: Please confirm your new password
ar: يرجى تأكيد كلمة المرور الجديدة

# CustomBoxFilled_Delete_Medicine
source: Delete Medicine
ar: حذف الدواء

# CustomBoxFilled_Cancel
source: Cancel
ar: إلغاء

# CustomBoxIcon_Alert
source: Alert!!
ar: تنبيه!!

# CustomBoxIcon_Are_you_sure_you_want_to_add_a_new_medication
source: Are you sure you want to add a new medication?
ar: هل أنت متأكد أنك تريد إضافة دواء جديد؟

# CustomBoxIcon_yes
source: Yes
ar: نعم

# CustomBoxIcon_No
source: No
ar: لا
