Repository: HimaYoussef/smart_medic
Catalog: lib/l10n/intl_*.arb
Languages: ar

# Super_Visor_type_choose
source: Choose
ar: اختر

# Super_Visor_type_Doctor
source: Doctor
ar: طبيب

# Super_Visor_type_Family
source: Family
ar: عائلة

# Super_Visor_type_Neighbor
source: Neighbor
ar: جار

# Login_Head
source: login
ar: تسجيل الدخول

# Login_Welcome_Back
source: Welcome Back
ar: مرحبًا بعودتك

# Login_Email
source: Enter your Email
ar: أدخل بريدك الإلكتروني

# Login_password
source: Enter your Password
ar: أدخل كلمة المرور

# Login_SIGN_IN
source: SIGN IN
ar: تسجيل الدخول

# Login_SnackBar
source: Please fill in all fields.
ar: يرجى ملء جميع الحقول.

# Login_Dont_have_an_account
source: Don’t have an account? SIGN UP
ar: ليس لديك حساب؟ سجل الآن

# Login_Email_not_verified_yet
source: Email not verified yet
ar: البريد الإلكتروني لم يتم التحقق منه بعد

# Login_Resend
source: Resend
ar: إعادة الإرسال

# Login_Verification_email_resent_Check_your_inbox
source: Verification email resent. Check your inbox.
ar: تمت إعادة إرسال بريد التحقق. تحقق من صندوق الوارد.

# Login_Failed_to_resend_verification_email
source: Failed to resend verification email
ar: فشل في إعادة إرسال بريد التحقق

# Login_Forgot_Password
source: Forgot Password?
ar: هل نسيت كلمة المرور؟

# resetPass_Password_reset_email_sent_Please_check_your_inbox
source: Password reset email sent! Please check your inbox.
ar: تم إرسال بريد إعادة تعيين كلمة المرور! يرجى التحقق من صندوق الوارد.

# resetPass_Reset_Your_Password
source: Reset Your Password
ar: إعادة تعيين كلمة المرور

# resetPass_Remember_your_password_Sign_in_now
source: Remember your password? Sign in now
ar: تتذكر كلمة المرور؟ قم بتسجيل الدخول الآن

# resetPass_Welcome_Back
source: Welcome Back
ar: مرحبًا بعودتك

# resetPass_Please_enter_a_valid_email
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح

# resetPass_Enter_your_Email
source: Enter your Email
ar: أدخل بريدك الإلكتروني

# resetPass_Reset
source: Reset
ar: إعادة تعيين

# signUp_SnackBar
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح

# signUp_Head
source: Sign Up
ar: تسجيل حساب

# signUp_Hello
source: Hello
ar: مرحبًا

# signUp_Name
source: Enter your Name
ar: أدخل اسمك

# signUp_Email
source: Enter your Email
ar: أدخل بريدك الإلكتروني

# signUp_password
source: Enter your Password
ar: أدخل كلمة المرور

# signUp_Confirm_Password
source: Confirm your Password
ar: تأكيد كلمة المرور

# signUp_SIGN_UP
source: SIGN UP
ar: تسجيل

# signUp_SnackBar_Please_Continue
source: Please continue...
ar: يرجى المتابعة...

# signUp_Please_enter_a_valid_email
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح

# signUp_Passwords_do_not_match
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# signUp_Already_have_an_account_SIGN_IN
source: Already have an account? SIGN IN
ar: هل لديك حساب؟ تسجيل الدخول

# login_cubit_errorMessage1
source: Login failed. User is null.
ar: فشل تسجيل الدخول. المستخدم غير موجود.

# login_cubit_errorMessage2
source: Email not verified yet.
ar: البريد الإلكتروني لم يتم التحقق منه بعد.

# login_cubit_errorMessage3
source: User data not found.
ar: لم يتم العثور على بيانات المستخدم.

# login_cubit_errorMessage4
source: No user found with this email
ar: لا يوجد مستخدم بهذا البريد الإلكتروني

# login_cubit_errorMessage5
source: Incorrect password
ar: كلمة المرور غير صحيحة

# login_cubit_errorMessage6
source: Authentication error
ar: خطأ في المصادقة

# login_cubit_errorMessage7
source: Unexpected error occurred
ar: حدث خطأ غير متوقع

# sign_up_cubit_SignUpFailure1
source: This email already used
ar: هذا البريد الإلكتروني مستخدم بالفعل

# sign_up_cubit_SignUpFailure2
source: The password is too weak
ar: كلمة المرور ضعيفة جدًا

# sign_up_cubit_SignUpFailure3
source: Unexpected error occurred
ar: حدث خطأ غير متوقع

# sign_up_cubit_EmailVerification1
source: Verification email has been sent
ar: تم إرسال بريد التحقق

# sign_up_cubit_EmailVerification2
source: User is already verified or not logged in
ar: المستخدم تم التحقق منه مسبقًا أو لم يقم بتسجيل الدخول

# Role_Selection_Head
source: Continue As..
ar: تابع كـ..

# Role_Selection_patient
source: Patient
ar: مريض

# Role_Selection_Supervisor
source: Supervisor
ar: مشرف

# Role_Selection_Next
source: Next
ar: التالي

# Nav_bar_Home
source: This is the Home tab to manage your medications.
ar: هذه هي صفحة الرئيسية لإدارة أدويتك.

# Nav_bar_Logs
source: View your medication logs here.
ar: اعرض سجلات أدويتك هنا.

# Nav_bar_Awar
source: Access health awareness content here.
ar: يمكنك الوصول إلى محتوى التوعية الصحية هنا.

# Nav_bar_Profile
source: Manage your profile settings here.
ar: قم بإدارة إعدادات ملفك الشخصي هنا.

# Add_New_Medicine_Head
source: Add New Medicine
ar: إضافة دواء جديد

# Add_New_Medicine_Compartment_Number
source: Compartment Number
ar: رقم الحجرة

# Add_New_Medicine_Med_Name
source: Medicine Name
ar: اسم الدواء

# Add_New_Medicine_labelText1
source: Enter medicine name
ar: أدخل اسم الدواء

# Add_New_Medicine_validatorText1
source: Please enter a medicine name
ar: يرجى إدخال اسم الدواء

# Add_New_Medicine_Pills
source: Pills
ar: الحبوب

# Add_New_Medicine_labelText2
source: Number of pills
ar: أدخل عدد الحبوب المضافة

# Add_New_Medicine_validatorText2
source: Please enter number of pills
ar: يرجى إدخال عدد الحبوب

# Add_New_Medicine_Dosage
source: Dosage
ar: الجرعة

# Add_New_Medicine_labelText3
source: Enter dosage
ar: أدخل عدد الحبوب في كل مرة

# Add_New_Medicine_validatorText3
source: Please enter dosage
ar: يرجى إدخال عدد الحبوب

# Add_New_Medicine_Schedule_Type
source: Schedule Type
ar: نوع الجدول

# Add_New_Medicine_How_many_times_per_day
source: How many times per day?
ar: كم مرة في اليوم؟

# Add_New_Medicine_labelText4
source: Enter number of times
ar: أدخل عدد المرات في اليوم

# Add_New_Medicine_validatorText4
source: Please enter a number between 1 and 4
ar: يرجى إدخال عدد المرات

# Add_New_Medicine_SnackBar
source: Please enter a number between 1 and 4
ar: عدد المرات يجب أن يكون بين 1 و4

# Add_New_Medicine_Add_Time
source: Add Time
ar: إضافة وقت

# Add_New_Medicine_Every_how_many_days
source: Every how many days?
ar: كل كم يوم؟

# Add_New_Medicine_labelText5
source: Enter number of days
ar: أدخل عدد الأيام

# Add_New_Medicine_validatorText5
source: Please enter number of days
ar: يرجى إدخال عدد الأيام

# Add_New_Medicine_Select_Specific_Days
source: Select Specific Days
ar: اختر أيام محددة

# Add_New_Medicine_Submit
source: Submit
ar: إرسال

# Add_New_Medicine_Please_select_a_schedule_type
source: Please select a schedule type
ar: يرجى اختيار نوع الجدول

# Add_New_Medicine_Please_select_all_times_for_daily_schedule
source: Please select all times for daily schedule
ar: يرجى تحديد جميع الأوقات للجدول اليومي

# Add_New_Medicine_Please_select_a_time_for_every_X_days_schedule
source: Please select a time for every X days schedule
ar: يرجى تحديد وقت لعدد الايام في الجدول

# Add_New_Medicine_Please_select_at_least_one_day_for_specific_days_schedule
source: Please select at least one day for specific days schedule
ar: يرجى اختيار يوم واحد على الأقل لجدول الأيام المحددة

# Add_New_Medicine_Select_Type
source: Select Schedule Type
ar: اختر النوع

# Add_New_Medicine_Daily
source: Daily
ar: يوميًا

# Add_New_Medicine_Every_X_Days
source: Every X Days
ar: كل (عدد) ايام

# Add_New_Medicine_Specific_Days
source: Specific Days
ar: أيام محددة

# Add_New_Medicine_Bluetooth_not_connected_Data_will_be_sent_later
source: Bluetooth not connected. Data will be sent later.
ar: البلوتوث غير متصل. سيتم إرسال البيانات لاحقًا.

# Add_New_Medicine_Please_select_a_time_for_specific_days_schedule
source: Please select a time for specific days schedule
ar: يرجى اختيار وقت لجدول الأيام المحددة

# Add_New_Medicine_Select_Option
source: Select an Option
ar: اختر خيارًا

# Add_New_Medicine_Take_Photo
source: Take Photo
ar: التقط صورة

# Add_New_Medicine_Pick_From_Gallery
source: Pick from Gallery
ar: اختر من المعرض

# Add_New_Medicine_Analyze_Name
source: Analyze Medicine Name
ar: تحليل اسم الدواء

# Add_New_Medicine_Please_Enter_Medicine_Name
source: Please enter a medicine name
ar: يرجى إدخال اسم الدواء

# Add_New_Medicine_Analyze_Options
source: Analyze Medicine
ar: تحليل الدواء

# Add_New_Medicine_AddTime
source: Add Time
ar: إضافة وقت

# Add_New_Medicine_ChangeTime
source: Change Time
ar: تغيير الوقت

# Add_New_Medicine_Add_AnotherTime
source: Add Another Time
ar: إضافة وقت آخر

# Add_New_Medicine_Analysis_Result
source: Analysis Result
ar: نتيجة التحليل

# Add_New_Medicine_OK
source: OK
ar: موافق

# Add_New_Medicine_Error
source: Error
ar: خطأ

# EditMedicine_Please_select_a_schedule_type
source: Please select a schedule type
ar: يرجى اختيار نوع الجدول

# EditMedicine_Please_select_all_times_for_daily_schedule
source: Please select all times for daily schedule
ar: يرجى تحديد جميع الأوقات للجدول اليومي

# EditMedicine_Please_select_a_time_for_every_X_days_schedule
source: Please select a time for every X days schedule
ar: يرجى تحديد وقت لعدد الايام في الجدول

# EditMedicine_Please_select_at_least_one_day_for_specific_days_schedule
source: Please select at least one day for specific days schedule
ar: يرجى اختيار يوم واحد على الأقل لجدول الأيام المحددة

# EditMedicine_Edit_Medicine
source: Edit Medicine
ar: تعديل الدواء

# EditMedicine_Compartment_Number
source: Compartment Number
ar: رقم الحجرة

# EditMedicine_Med_Name
source: Med Name
ar: اسم الدواء

# EditMedicine_labelText1
source: Enter the name of the Medicine
ar: أدخل اسم الدواء

# EditMedicine_validatorText1
source: Please enter the name of the medicine
ar: يرجى إدخال اسم الدواء

# EditMedicine_Pills
source: Pills
ar: الحبوب

# EditMedicine_labelText2
source: Enter the number of pills added
ar: أدخل عدد الحبوب المضافة

# EditMedicine_validatorText2
source: Please enter the number of pills
ar: يرجى إدخال عدد الحبوب

# EditMedicine_Dosage
source: Dosage
ar: الجرعة

# EditMedicine_labelText3
source: Enter the number of pills every time
ar: أدخل عدد الحبوب في كل مرة

# EditMedicine_validatorText3
source: Please enter the number of the pills
ar: يرجى إدخال عدد الحبوب

# EditMedicine_Schedule_Type
source: Schedule Type
ar: نوع الجدول

# EditMedicine_How_many_times_per_day
source: How many times per day?
ar: كم مرة في اليوم؟

# EditMedicine_labelText4
source: Enter number of times per day
ar: أدخل عدد المرات في اليوم

# EditMedicine_validatorText4
source: Please enter the number of the times
ar: يرجى إدخال عدد المرات

# EditMedicine_SnackBar
source: Number of times must be between 1 and 4
ar: عدد المرات يجب أن يكون بين 1 و4

# EditMedicine_Add_Time
source: Add Time
ar: إضافة وقت

# EditMedicine_Every_how_many_days
source: Every how many days
ar: كل كم يوم؟

# EditMedicine_labelText5
source: Enter number of days
ar: أدخل عدد الأيام

# EditMedicine_validatorText5
source: Please enter the number of the days
ar: يرجى إدخال عدد الأيام

# EditMedicine_Select_Specific_Days
source: Select Specific Days
ar: اختر أيام محددة

# EditMedicine_Update
source: Update
ar: تحديث

# EditMedicine_Select_Type
source: Select Type
ar: اختر النوع

# EditMedicine_Daily
source: Daily
ar: يوميًا

# EditMedicine_Every_X_Days
source: Every X Days
ar: كل (عدد)ايام

# EditMedicine_Specific_Days
source: Specific Days
ar: أيام محددة

# EditMedicine_Bluetooth_not_connected_Data_will_be_sent_later
source: Bluetooth not connected. Data will be sent later.
ar: البلوتوث غير متصل. سيتم إرسال البيانات لاحقًا.

# Refill_Medicine_Head
source: Refill Medicine
ar: إعادة تعبئة الدواء

# Refill_Medicine_Num_of_Pills
source: Num of Pills
ar: عدد الحبوب

# Refill_Medicine_Enter_The_Num_of_pills_added
source: Enter The Num of pills added
ar: أدخل عدد الحبوب المضافة

# Refill_Medicine_Please_enter_the_number_of_pills
source: Please enter the number of pills
ar: يرجى إدخال عدد الحبوب

# Patient_Main_view_Home
source: Home
ar: الرئيسية

# Patient_Main_view_Error_loading_medications
source: Error loading medications
ar: حدث خطأ أثناء تحميل الأدوية

# Patient_Main_view_Empty_Icon
source: Tap here to add a medication
ar: اضغط هنا لإضافة دواء

# Awareness_view_Awareness
source: Awareness
ar: التوعية

# Awareness_view_title1
source: Mental Health
ar: الصحة النفسية

# Awareness_view_description1
source: During the COVID-19 pandemic, young people experienced spikes in mental health difficulties, with girls taking a harder hit.
ar: خلال جائحة كوفيد-19، واجه الشباب صعوبات نفسية متزايدة، وكانت الفتيات الأكثر تأثرًا.

# Awareness_view_title2
source: Daily Calorie
ar: السعرات الحرارية اليومية

# Awareness_view_description2
source: Whether you're trying to lose weight, gain weight, or stick to your current weight, it's important to know how many calories you need to eat each day.
ar: سواء كنت تحاول فقدان الوزن أو زيادته أو الحفاظ عليه، من المهم أن تعرف عدد السعرات التي تحتاجها يوميًا.

# Awareness_view_title3
source: Always Finish Your Antibiotics—Even If You Feel Better
ar: أنهِ كورس المضاد الحيوي بالكامل — حتى لو شعرت بتحسن

# Awareness_view_description3
source: If your doctor gives you antibiotics, it’s important to finish the full course. Even if you feel better after a few days, stopping early can cause the infection to return—stronger than before. Your smart box keeps track of how many days are left and reminds you until the last pill. It’s a simple way to protect yourself from future illness. Let’s treat the infection right the first time.
ar: إذا وصف لك الطبيب مضادًا حيويًا، من المهم أن تنهي الكورس كاملًا. حتى لو شعرت بتحسن بعد بضعة أيام، فإن التوقف مبكرًا يمكن أن يؤدي إلى عودة العدوى — أقوى من قبل. الصندوق الذكي يتتبع عدد الأيام المتبقية ويذكّرك حتى تتناول آخر حبة. إنها طريقة بسيطة لحماية نفسك من المرض مستقبلاً. لنعالج العدوى بالشكل الصحيح من أول مرة.

# Awareness_view_title4
source: Are You Taking Multiple Medications? Stay Safe
ar: هل تتناول عدة أدوية؟ احرص على سلامتك

# Awareness_view_description4
source: Many older adults take more than one medicine a day—and that’s okay, but it needs care. Some pills don’t mix well together. Your smart medical box and app help organize everything so you take the right pills at the right time. If anything ever feels off, always call your doctor. Staying informed is one of the best ways to stay healthy.
ar: العديد من كبار السن يتناولون أكثر من دواء يوميًا — وهذا أمر طبيعي، لكنه يحتاج إلى عناية. بعض الأدوية لا تتفاعل جيدًا مع بعضها. الصندوق الطبي الذكي والتطبيق يساعدانك على تنظيم كل شيء لتأخذ الأدوية الصحيحة في الوقت المناسب. وإذا شعرت بأي شيء غير طبيعي، اتصل بطبيبك فورًا. البقاء على اطلاع هو أحد أفضل طرق الحفاظ على صحتك.

# Awareness_view_title5
source: Why It’s Important to Take Your Medicine on Time
ar: لماذا من المهم تناول دوائك في الوقت المحدد

# Awareness_view_description5
source: Your medicine works best when taken at the right time every day. Missing a dose can make it harder to manage conditions like high blood pressure or diabetes. That’s why your smart medical box gives you friendly reminders. It helps you stay safe and keeps your health on the right track. Trust the system—it’s here to support you.
ar: دواؤك يعمل بشكل أفضل عند تناوله في الوقت المناسب كل يوم. تفويت جرعة قد يصعب السيطرة على حالات مثل ارتفاع ضغط الدم أو السكري. ولهذا السبب يعطيك الصندوق الذكي تذكيرات ودية. إنه يساعدك على البقاء آمنًا ويحافظ على صحتك في المسار الصحيح. ثق بالنظام — فهو هنا لدعمك.

# Awareness_view_title6
source: What Happens If You Skip a Dose?
ar: ماذا يحدث إذا نسيت تناول جرعة؟

# Awareness_view_description6
source: Sometimes we forget to take a pill, but skipping medicine can be risky. It may cause problems like dizziness, high sugar levels, or breathing trouble—depending on your condition. That’s why your smart box alerts you gently, so you never miss an important dose. Following your medication plan can keep you out of the hospital and feeling better every day. One small habit can protect your whole body.
ar: أحيانًا ننسى تناول الحبوب، ولكن تفويت الدواء قد يكون خطيرًا. قد يسبب مشاكل مثل الدوخة أو ارتفاع مستوى السكر أو صعوبة في التنفس — حسب حالتك. لهذا السبب ينبهك الصندوق الذكي بلطف حتى لا تفوت أي جرعة مهمة. اتباع خطة الدواء قد يجنبك زيارة المستشفى ويجعلك تشعر بتحسن كل يوم. عادة صغيرة قد تحمي جسدك بالكامل.

# Awareness_view_title7
source: Easy Ways to Remember Your Pills
ar: طرق سهلة لتتذكر تناول أدويتك

# Awareness_view_description7
source: We all forget things from time to time. That’s why your smart medical box is designed to make life easier. It lights up, makes a sound, and even sends a message to your phone when it’s time for your medicine. No need to memorize anything—just follow the gentle alert. Let the technology take care of remembering, so you can focus on living well.
ar: جميعنا ننسى الأشياء من وقت لآخر. ولهذا السبب تم تصميم الصندوق الطبي الذكي ليجعل حياتك أسهل. يضيء، يصدر صوتًا، بل ويرسل رسالة إلى هاتفك عندما يحين وقت الدواء. لا حاجة لحفظ المواعيد — فقط اتبع التنبيه اللطيف. دع التقنية تتولى التذكير، وركز أنت على عيش حياتك بشكل جيد.

# Patient_Logs_View_logs
source: Logs
ar: السجلات

# Patient_Logs_View_Error_loading_logs
source: Error loading logs
ar: حدث خطأ أثناء تحميل السجلات

# Patient_Logs_View_No_logs_available
source: No logs available
ar: لا توجد سجلات متاحة

# Patient_Logs_View_No_valid_logs_available
source: No valid logs available
ar: لا توجد سجلات صالحة متاحة

# ImagePreviewScreen_Profile_Image
source: Profile Image
ar: صورة الملف الشخصي

# ImagePreviewScreen_Error_loading_image
source: Error loading image
ar: حدث خطأ أثناء تحميل الصورة

# Supervision_view_Head
source: Supervisors
ar: المشرفون

# Supervision_view_Error_loading_supervisors
source: Error loading supervisors
ar: حدث خطأ أثناء تحميل المشرفين

# Supervision_view_No_supervisors_found
source: No supervisors found
ar: لم يتم العثور على مشرفين

# Supervision_view_Add_Supervisor
source: Tap here to add a new supervisor
ar: اضغط هنا لإضافة مشرف جديد

# Patient_Profile_view_Profile
source: Profile
ar: الملف الشخصي

# Patient_Profile_view_Please_log_in_to_view_your_profile
source: Please log in to view your profile
ar: يرجى تسجيل الدخول لعرض ملفك الشخصي

# Patient_Profile_view_Dark_Mode
source: Dark Mode
ar: الوضع الداكن

# Patient_Profile_view_Supervisor
source: Supervisor
ar: المشرف

# Patient_Profile_view_Change_Language
source: Change Language
ar: تغيير اللغة

# Patient_Profile_view_Log_out
source: Log out
ar: تسجيل الخروج

# Patient_Profile_view_Rewards
source: Rewards
ar: الهدايا

# Patient_Profile_view_Change_password
source: Change Password
ar: تغيير كلمة المرور

# Patient_Profile_view_Tap_here_to_edit_your_profile_information
source: Click Here To Edit Your Profile
ar: اضغط هنا لتعديل معلومات ملفك الشخصي

# Patient_Profile_view_Toggle_between_light_and_dark_themes
source: Click Here To Toggle Between Dark & Light Mode
ar: اضغط هنا للتبديل بين الوضع الفاتح والداكن

# Patient_Profile_view_View_or_manage_your_supervisors
source: Click Here To Add Your Supervisor
ar: اضغط هنا لإضافة المشرف الخاص بك

# Patient_Profile_view_Switch_between_languages
source: Click Here To Change Your Language
ar: اضغط هنا لتغيير اللغة

# Patient_Profile_view_Sign_out_of_your_account
source: Click Here To Log out From Your Acoount
ar: اضغط هنا لتسجيل الخروج من حسابك

# Patient_Profile_view_reward
source: Click Here To See Review your Progress
ar: اضغط هنا لمراجعة تقدمك

# rewardsView_Rewards
source: Rewards
ar: المكافآت

# rewardsView_Error_loading_Rewards
source: Error loading Rewards
ar: حدث خطأ أثناء تحميل المكافآت

# rewardsView_your_streak
source: your streak
ar: سلسلتك المتواصلة

# rewardsView_No_rewards_available
source: No rewards available
ar: لا توجد مكافآت متاحة

# rewardsView_Rewards_has_been_used
source: Rewards has been used
ar: تم استخدام المكافأة

# rewardsView_Use
source: Use
ar: استخدام

# Admin_Profile_Supervisor_Data
source: Click Here To Display The Supervisors in the System
ar: اضغط هنا لعرض المشرفين في النظام

# Admin_Profile_Patient_Data
source: Click Here To Display The Patient in the System
ar: اضغط هنا لعرض المرضى في النظام

# Admin_Profile_Patient_Data_Display
source: Patients Data
ar: بيانات المرضى

# Admin_Profile_Supervisor_Data_Display
source: Supervisors Data
ar: بيانات المشرفين

# Admin_Profile_Change_Password
source: Change Password
ar: تغيير كلمة المرور

# Patient_Data_No_patients_found
source: No patients found.
ar: لم يتم العثور على أي مرضى.

# Superviosr_Data_No_supervisors_found
source: No supervisors found.
ar: لم يتم العثور على أي مشرفين.

# Add_Supervisor_Add_Supervisor
source: Add Supervisor
ar: إضافة مشرف

# Add_Supervisor_Name
source: Name
ar: الاسم

# Add_Supervisor_labelText1
source: Enter The name of the Supervisor
ar: أدخل اسم المشرف

# Add_Supervisor_validatorText1
source: Please Enter The name of the Supervisor
ar: يرجى إدخال اسم المشرف

# Add_Supervisor_Email
source: Email
ar: البريد الإلكتروني

# Add_Supervisor_validatorText2
source: Please Enter the Email of the Supervisor
ar: يرجى إدخال بريد المشرف الإلكتروني

# Add_Supervisor_labelText2
source: Enter The Email of the Supervisor
ar: أدخل بريد المشرف الإلكتروني

# Add_Supervisor_Supervisor_type
source: Supervisor type
ar: نوع المشرف

# Add_Supervisor_Supervisor_Add
source: Add
ar: إضافة

# Add_Supervisor_Choose
source: Choose
ar: اختر

# Add_Supervisor_Please_select_a_valid_Supervisor_type
source: Please select a valid Supervisor type
ar: يرجى اختيار نوع مشرف صالح

# Edit_Profile_Head
source: Edit Profile
ar: تعديل الملف الشخصي

# Edit_Profile_Name
source: Name
ar: الاسم

# Edit_Profile_labelText1
source: Please Enter Your Name
ar: يرجى إدخال اسمك

# Edit_Profile_validatorText1
source: Please Enter A valid Name
ar: يرجى إدخال اسم صالح

# Edit_Profile_Email
source: Email
ar: البريد الإلكتروني

# Edit_Profile_labelText2
source: Please Enter Your Email
ar: يرجى إدخال بريدك الإلكتروني

# Edit_Profile_validatorText2
source: Please Enter your Email
ar: يرجى إدخال بريدك الإلكتروني

# Edit_Profile_Age
source: Age
ar: العمر

# Edit_Profile_labelText3
source: Please Enter Your Age
ar: يرجى إدخال عمرك

# Edit_Profile_validatorText3
source: Please Enter Your Age
ar: يرجى إدخال عمرك

# Edit_Profile_Edit
source: Edit
ar: تعديل

# Edit_Supervisor_Head
source: Edit Supervisor
ar: تعديل المشرف

# Edit_Supervisor_Name
source: Name
ar: الاسم

# Edit_Supervisor_labelText1
source: Enter The name of the Supervisor
ar: أدخل اسم المشرف

# Edit_Supervisor_validatorText1
source: Please Enter The name of the Supervisor
ar: يرجى إدخال اسم المشرف

# Edit_Supervisor_Email
source: Email
ar: البريد الإلكتروني

# Edit_Supervisor_labelText2
source: Enter The Email of the Supervisor
ar: أدخل بريد المشرف الإلكتروني

# Edit_Supervisor_validatorText2
source: Please Enter The Email of the Supervisor
ar: يرجى إدخال بريد المشرف الإلكتروني

# Edit_Supervisor_Supervisor_type
source: Supervisor type
ar: نوع المشرف

# Edit_Supervisor_update
source: Update
ar: تحديث

# Edit_Profile_No_user_is_signed_in
source: No user is signed in.
ar: لا يوجد مستخدم مسجل الدخول.

# Edit_Profile_Name_must_contain_only_letters_and_spaces
source: Name must contain only letters and spaces.
ar: يجب أن يحتوي الاسم على أحرف ومسافات فقط.

# Edit_Profile_Profile_updated_successfully
source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!

# Supervision_Supervision
source: Supervision
ar: الإشراف

# Supervision_No_patients_found
source: No patients found
ar: لم يتم العثور على أي مرضى

# Supervision_Error_loading_patients
source: Error loading patients
ar: حدث خطأ أثناء تحميل المرضى

# Supervisor_Profile_view_Profile
source: Profile
ar: الملف الشخصي

# Supervisor_Profile_view_Please_log_in_to_view_your_profile
source: Please log in to view your profile
ar: يرجى تسجيل الدخول لعرض ملفك الشخصي

# Supervisor_Profile_view_Dark_Mode
source: Dark Mode
ar: الوضع الداكن

# Supervisor_Profile_view_Change_Language
source: Change Language
ar: تغيير اللغة

# Supervisor_Profile_view_Log_out
source: Log out
ar: تسجيل الخروج

# Supervisor_Profile_view_Change_password
source: Change password
ar: تغيير كلمة المرور

# build_text_field_validatorText1
source: Please Enter A valid email
ar: يرجى إدخال بريد إلكتروني صالح
